[
  {
    "images": [
      "portfolio/kinetic-portal-img.png",
      "portfolio/kinetic-portal-img-2.png",
      "portfolio/kinetic-portal-img-3.png",
      "portfolio/kinetic-portal-img-4.png"
    ],
    "title": "Kinetic Portal",
    "category": "administrative",
    "url": "https://portal.kineticstaff.com/",
    "description": "This project focused on boosting HR and administrative efficiency. It introduced a unified platform that handled leave and overtime requests, internal job postings, and employee contracts. Key features included a resume format for daily applicants, a payroll schedule manager, and advanced activity reports. Built to streamline HR operations, the platform improved employee experience and workflow.\n\nKey Contribution:\n• Automated Late WebJobs to run every 30 minutes, improving attendance tracking and cutting absenteeism response time by 25%.\n• Built WebJobs to pull 100,000+ daily data points from APIs (Holiday, Screenshot Monitor, Time Doctor, Hubstaff), boosting data accuracy and reducing manual input.\n• Created a Booking Calendar with FullCalendar to automate orientation scheduling for 63,000+ candidates.\n• Developed a timesheet monitor for 4,000+ team members, improving accountability and reducing errors.\n• Supported 70+ internal users by quickly resolving app issues, ensuring smooth business operations.\n• Built a sessionization algorithm to reconstruct continuous sessions from raw Hubstaff logs — increasing time-tracking accuracy by 90% for over 4,000 users.\n• Redesigned and optimized complex SQL Server queries handling 9 million candidate records, implementing strategic indexing, query plan optimization, and stored procedure refactoring to enhance database performance and user experience.\n• Strengthened application security by implementing user role-based access control for API authorization, integrating JWT token validation for secure authentication, and utilizing parameterized queries with Dapper to eliminate SQL injection vulnerabilities.\n• Implemented AES-256 encryption to secure team members' salary data at rest, ensuring confidentiality and compliance with data protection standards.\n• Implemented materialized views as a database-level caching strategy to precompute and store query results, reducing response times and improving performance for read-intensive workloads.",
    "techStack": [
      "C#",
      ".NET",
      "Angular",
      "SQL Server",
      "Azure",
      "Dapper",
      "JWT"
    ]
  },
  {
    "images": [
      "portfolio/xamun-ai-img.png",
      "portfolio/xamun-ai-img-2.png"
    ],
    "title": "Xamun Dev Portal",
    "category": "ai solutions",
    "url": "https://www.xamun.ai/",
    "description": "A full-code platform for startups and digital projects—faster and simpler than Low-Code.\n\nKey Contribution:\n• Wrote PowerShell scripts for Azure Pipelines to automate CI/CD, cut deployment time, and reduce errors.\n• Integrated workflows using the DrawFlow library to streamline process design.\n• Built a reusable Angular schematics library to speed up development and ensure UI consistency.\n• Deployed scalable web apps with Azure and Docker, boosting release speed and system stability.\n• Set up secure external logins with IdentityServer4, connecting Facebook, Google, and AzureAD to simplify user access.\n• Built an Azure Services Class Library with Polly for resilient communication between services, incorporating retry logic and a circuit breaker pattern to enhance fault tolerance.",
    "techStack": [
      "C#",
      ".NET",
      "Angular",
      "Azure",
      "Docker",
      "IdentityServer4",
      "Polly"
    ]
  },
  {
    "images": [
      "portfolio/rivington-1.jpg",
      "portfolio/rivington-2.jpg",
      "portfolio/rivington-3.jpg"
    ],
    "title": "Rivington (Collections Application, AMIG Application, Centauri Application)",
    "category": "insurance",
    "url": "#",
    "description": "Rivington Partners is a managing general agency that focuses on writing specialty property & casualty insurance and placing risk with sponsoring insurance carriers.\n\nKey Contribution:\n• Built a Reports API using ClosedXML and LargeXLSX .NET to handle payments, premiums, cancellations, and endorsements.\n• Led development of a Claims feature to import external data into the RivTech Star App, improving data integration.\n• Developed and managed Azure Functions to automate daily and monthly financial transaction reports, enabling timely, accurate insights and supporting high-volume payment processing workflows.\n• Built and tested complex reporting logic for premium tracking—covering inforce, written, earned, and unearned—ensuring compliance and accuracy.\n• Led backend improvements focused on performance, research, and new development efforts.\n• Developed dynamic, state-based forms tailored for U.S. users to improve data input and UX.\n• Upgraded the backend from .NET Core 2.1 to .NET 5.0, modernizing the stack and boosting performance.\n• Migrated Azure Functions to .NET 5.0 Isolated Process to improve scalability and cloud performance.",
    "techStack": [
      "C#",
      ".NET 5",
      "Azure Functions",
      "SQL Server",
      "ClosedXML"
    ]
  },
  {
    "images": [
      "portfolio/daikin-ecommerce-1.jpg"
    ],
    "title": "Daikin E-commerce",
    "category": "e-commerce",
    "url": "https://shop.daikin.com.ph/catalog",
    "description": "Daikin Philippines runs an online store for air purifiers, enabling customers to browse and purchase products seamlessly.\n\nKey Contribution:\n• Implemented end-to-end payment integration with Paynamics for enabling secure transaction processing and handling card payment flows.\n• Built webhooks, APIs, and blob storage systems with SQL scripts and social login via Facebook and Google.\n• Designed and implemented Split Pay functionality with Paynamics, enabling automated payment segregation to multiple stakeholders (merchants, logistics, digital platforms) during a single customer transaction, with convenience fees configured per payment channel — e.g., Credit/Debit Cards (4% + ₱20), Online Bank Transfer/E-Wallets (2.5%), Over-the-Counter (₱25), and Installments (0.60% for credit cards, 2.50% for non-credit).",
    "techStack": [
      "C#",
      ".NET",
      "SQL Server",
      "Azure Blob",
      "Paynamics"
    ]
  },
  {
    "images": [
      "portfolio/daikin-virtualshowroom-1.jpg",
      "portfolio/daikin-virtualshowroom-2.jpg"
    ],
    "title": "Daikin Virtual Showroom",
    "category": "e-commerce",
    "url": "#",
    "description": "Daikin's Virtual Showroom helps customers explore products without visiting a physical store, providing an immersive online browsing experience.\n\nKey Contribution:\n• Boosted API performance for the Virtual Showroom through focused optimization.\n• Developed CRUD APIs and service classes to manage data more efficiently.\n• Designed the ERD for the Virtual Showroom database to support structured data storage and fast retrieval.",
    "techStack": [
      "C#",
      ".NET",
      "SQL Server",
      "Azure"
    ]
  },
  {
    "images": [
      "portfolio/iscan-1.jpg",
      "portfolio/iscan-2.jpg"
    ],
    "title": "iScan Diagnostic Center",
    "category": "healthcare",
    "url": "#",
    "description": "iScan offers fast, reliable medical imaging services, powered by a skilled and patient-focused team.\n\nKey Contribution:\n• Built backend workflows for release and notification modules, improving control and speeding up communication.\n• Developed and maintained an Azure Function to automate alerts, boosting response time and cutting manual work.\n• Set up SMTP for email alerts and integrated Telerivet for SMS, ensuring reliable, multi-channel messaging.",
    "techStack": [
      "C#",
      ".NET",
      "Azure Functions",
      "SMTP",
      "Telerivet"
    ]
  },
  {
    "images": [
      "portfolio/mundipharma-1.jpg",
      "portfolio/mundipharma-2.jpg"
    ],
    "title": "My Scorecard (Mundipharma)",
    "category": "healthcare",
    "url": "#",
    "description": "A web app that processes sales data and calculates employee incentives. Exports payout summaries and reports directly to Excel.\n\nKey Contribution:\n• Led web development using .NET Core, React.js, and Redux.\n• Deployed the app using Jenkins and IIS.\n• Overhauled report generation workflows to improve speed and clarity.",
    "techStack": [
      ".NET Core",
      "React",
      "Redux",
      "Jenkins",
      "IIS"
    ]
  },
  {
    "images": [
      "portfolio/magsaysay-1.jpg"
    ],
    "title": "Magsaysay Online Careers",
    "category": "recruitment",
    "url": "#",
    "description": "A mobile and web-based HR platform for end-to-end recruitment. Built for ease of use and seamless hiring.\n\nKey Contribution:\n• Integrated Zoom API to streamline meetings and boost communication.\n• Debugged the codebase thoroughly to resolve issues fast and keep the app reliable.",
    "techStack": [
      "C#",
      ".NET",
      "Zoom API",
      "SQL Server"
    ]
  },
  {
    "images": [
      "portfolio/marius-1.jpg",
      "portfolio/marius-2.jpg"
    ],
    "title": "Marius",
    "category": "insurance",
    "url": "#",
    "description": "Marius is a cyber-insurance platform for clients, underwriters, and system admins. It manages policies from application to endorsement, renewal, cancellation, and claims.\n\nKey Contribution:\n• Built secure upload/download features using Azure Blob Storage to manage files at scale.\n• Developed modules for quote binding and bind requests, speeding up policy handling and boosting efficiency.\n• Developed modules for payments, endorsements, and cancellations to ensure accurate transactions and improve user satisfaction.",
    "techStack": [
      "C#",
      ".NET",
      "Azure Blob",
      "SQL Server"
    ]
  },
  {
    "images": [
      "portfolio/tempest-1.jpg",
      "portfolio/tempest-2.jpg"
    ],
    "title": "Tempest Asset Management",
    "category": "administrative",
    "url": "#",
    "description": "This system lets school staff track repairs from start to finish—from part usage to student restoration time. Accessible from any browser, anytime, on any device.\n\nKey Contribution:\n• Built reusable components and services across API, backend, and frontend.\n• Improved and added features to the web app for the TIG user base.",
    "techStack": [
      "C#",
      ".NET",
      "Angular",
      "SQL Server"
    ]
  },
  {
    "images": [
      "portfolio/catalyst-1.jpg",
      "portfolio/catalyst-2.jpg"
    ],
    "title": "Catalyst",
    "category": "others",
    "url": "#",
    "description": "A code generator tool that helps build high-quality software faster.\n\nKey Contribution:\n• Built a full client app from scratch using Angular 9.\n• Set up and deployed the Angular schematic project as npm package.\n• Integrated Azure services including Queue, Function, Table, Cosmos DB, and Storage.",
    "techStack": [
      "Angular 9",
      "Azure",
      "Cosmos DB",
      "npm"
    ]
  },
  {
    "images": [
      "portfolio/homeqube-1.jpg"
    ],
    "title": "HomeQube",
    "category": "ai solutions",
    "url": "https://www.homeqube.com/",
    "description": "Homeqube builds performance systems to tackle global housing shortages. It champions decentralization, open access, and breaking down barriers in knowledge, production, and supply.\n\nKey Contribution:\n• Researched and applied tools like Plotly.js, Leaflet.js, and Pako.js to meet stakeholder needs.\n• Built reusable components and services for both front-end and back-end development.",
    "techStack": [
      "C#",
      ".NET",
      "Angular",
      "Plotly.js",
      "Leaflet.js",
      "Pako.js"
    ]
  },
  {
    "images": [
      "portfolio/mkchess-1.jpg"
    ],
    "title": "Chess Book Analyzer",
    "category": "others",
    "url": "https://www.chessbookanalyzer.com/",
    "description": "A web-based chess book analyzer built as a personal project for studying chess openings and games interactively. It lets users load chess books (PDF/DjVu/ePub), display them side-by-side with an interactive chessboard, and analyze positions with Stockfish engine evaluation — all running locally in the browser with no server required.\n\nKey Features:\n• Interactive chessboard with drag-and-drop piece movement, move navigation, and board annotations (arrows and highlights).\n• Integrated Stockfish engine analysis running via Web Workers for real-time position evaluation.\n• Built-in book reader supporting PDF, DjVu, and ePub formats with a resizable split-panel layout.\n• PGN export and full move history with NAG annotation support (!, ?, !!, ??, etc.).\n• Tree-based variation/branching system for exploring side lines without losing the main line.\n• IndexedDB persistence to save and restore study sessions across browser reloads.\n• PWA-ready with offline capability — fully runs in the browser with zero backend dependency.\n\nTech Stack: Vanilla JavaScript, chess.js (v1.x), chessboard.js, Stockfish WASM, PDF.js, DjVu.js, ePub.js, IndexedDB.",
    "techStack": [
      "JavaScript",
      "chess.js",
      "Stockfish WASM",
      "PDF.js",
      "IndexedDB"
    ]
  },
  {
    "images": [
      "portfolio/kcmj-2.png",
      "portfolio/kcmj-3.png",
      "portfolio/kcmj-1.png"
    ],
    "title": "KCMJ Sari-Sari Store POS",
    "category": "others",
    "url": "#",
    "description": "A full-featured Point of Sale (POS) system built for a family-owned sari-sari store. Designed for daily retail operations with real-time inventory tracking, sales monitoring, and credit management — optimized for tablet and mobile use by non-technical users.\n\nKey Features:\n• Dashboard overview with today's sales, cash on hand, profit, petty cash, and outstanding credit (utang) summary.\n• Real-time inventory management with best sellers ranking, stock velocity tracking, days-left estimates, and low stock alerts.\n• QR code scanning and manual product search for fast checkout.\n• Credit/Utang system with per-customer balance tracking, payment recording, and overdue alerts (30+ days).\n• Cash register management with starting balance, cash-out, petty cash, and full audit trail history.\n• Sales trend charts (7-day and 3-month) and best sellers analytics by revenue and quantity.\n• Purchase expense tracking for monitoring spending on goods for resale.\n• Dual-mode support: Admin dashboard with full controls and a simplified Sales Terminal for cashiers.\n• Built with Angular 19, Supabase (PostgreSQL + Auth + RLS), and SCSS with a mobile-first responsive design.",
    "techStack": [
      "Angular 19",
      "TypeScript",
      "Supabase",
      "PostgreSQL",
      "SCSS",
      "Chart.js"
    ]
  },
  {
    "images": [
      "portfolio/chesslabae-1.png",
      "portfolio/chesslabae-2.png"
    ],
    "title": "ChessLab AE",
    "category": "others",
    "url": "https://chesslab.ae/",
    "description": "A Dubai-based chess academy website built for ChessLab AE, a training platform led by International Masters, FIDE Certified Instructors, and Sports Psychologists. The site serves as the digital front for their coaching programs, tournament events, and community engagement — helping players of all levels from beginners to competitive tournament players.\n\nKey Features:\n• Landing page with a video background hero section showcasing the academy's brand and call-to-action for booking assessments.\n• Structured training roadmap displaying three learning tiers — First Movers (beginner), Star Class (intermediate), and Elite Class (advanced) — each with Google Calendar booking integration.\n• Team profiles section highlighting coaches and staff with their titles, certifications, and personal quotes.\n• Events section featuring recent and upcoming FIDE-rated tournaments with event details and registration links.\n• Client testimonials carousel with reviews from parents and chess players.\n• FAQ accordion section addressing common questions about programs, age requirements, coaching qualifications, and class formats.\n• Multi-branch contact section with Google Maps integration, WhatsApp link, social media links, and operating hours.\n• Fully responsive design optimized for desktop and mobile devices.\n\nTech Stack: WordPress, Softaculous.",
    "techStack": [
      "WordPress",
      "Softaculous"
    ]
  }
]