[
  {
    "name": "Kelly Ann David-Salcedo",
    "subtitle": "ChessLab AE",
    "date": "Feb 2026",
    "relation": "Manager",
    "text": "They were outsourced from Dubai. Working with them has been smooth despite the time difference. They respond quickly, communicate clearly, and handle everything without needing much direction. Please check chesslab.ae to his work with us hehe"
  },
  {
    "name": "Cindy Mae Nilooban",
    "subtitle": "Kinetic Innovative Staffing",
    "date": "Feb 2026",
    "relation": "Technical Recruiter",
    "text": "Marc is a valued member of the IT support team at Kinetic, and I would confidently say he is one of the best members of the team. He is extremely reliable and always ready to help. Whenever you reach out to him, getting support is never complicated. He responds quickly and often calls right away to address any concerns, so you are never left waiting. Marc is truly just one call away, which makes a huge difference, especially when working under tight deadlines. He consistently ensures that issues are resolved as quickly as possible and provides timely support you can depend on. Thank you, Marc! ❤"
  },
  {
    "name": "Mark Rayden Mirafuente",
    "subtitle": "Kinetic Innovative Staffing",
    "date": "Feb 2026",
    "relation": "Senior Web Developer",
    "text": "Marc was my lead when I was a junior developer, and we both had an opportunity of working together for the past three years. By carefully guiding me through difficult tasks and teaching me how to approach challenges with confidence and structure, he significantly contributed to my growth. It was very motivating to see his rapid progression and deserved promotion to senior level. I've witnessed him effectively manage challenging projects with professionalism, skill, and leadership during our time together. In addition to his technical expertise, Marc inspires others around him and guides them toward becoming better developers."
  },
  {
    "name": "Charles Kenichi Nazareno",
    "subtitle": "BlastAsia, Inc.",
    "date": "Feb 2026",
    "relation": "Senior Software Engineer",
    "text": "I've had the opportunity to work with Marc since 2019, and throughout the years, he has consistently proven himself to be one of the best programmers I've worked with. What sets Marc apart is not just his technical skill, but his ability to truly grasp requirements and translate them into the best possible outcome. He doesn't just code based on instructions — he takes the time to understand the overall flow, the purpose behind the feature, and how everything connects within the bigger picture. He asks the right questions, thinks things through carefully, and ensures that solutions are clean, efficient, and well-structured. Beyond his technical strengths, Marc is also genuinely fun to hang out with. He brings positive energy to the team, making collaboration enjoyable and creating a great working atmosphere. It's been a pleasure working alongside him, and any team would be lucky to have someone with his level of skill, dedication, and personality."
  },
    {
    "name": "Klyde Jeremy Lingcod",
    "subtitle": "BlastAsia, Inc.",
    "date": "Feb 2026",
    "relation": "Senior Software Engineer",
    "text": "Marc Kenneth Lomio is not just a great software engineer, but also a strong and reliable leader. He's approachable, fun to work with, and creates a positive team environment that makes collaboration easy and enjoyable. He's always quick to help when someone needs support and leads by example through his work ethic and technical skill. Marc consistently delivers solid, well-thought-out code and has a clear, structured approach to problem-solving. His ability to guide the team, share knowledge, and keep things moving smoothly makes him an invaluable part of any development team."
  }
]